; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p6---int100n150-m25---int100c150---s75---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 level125 level126 level127 level128 level129 level130 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level13 level13)
(sum level0 level14 level14)
(sum level0 level20 level20)
(sum level0 level23 level23)
(sum level0 level24 level24)
(sum level1 level2 level3)
(sum level1 level13 level14)
(sum level1 level14 level15)
(sum level1 level20 level21)
(sum level1 level23 level24)
(sum level1 level24 level25)
(sum level2 level2 level4)
(sum level2 level13 level15)
(sum level2 level14 level16)
(sum level2 level20 level22)
(sum level2 level23 level25)
(sum level2 level24 level26)
(sum level3 level2 level5)
(sum level3 level13 level16)
(sum level3 level14 level17)
(sum level3 level20 level23)
(sum level3 level23 level26)
(sum level3 level24 level27)
(sum level4 level2 level6)
(sum level4 level13 level17)
(sum level4 level14 level18)
(sum level4 level20 level24)
(sum level4 level23 level27)
(sum level4 level24 level28)
(sum level5 level2 level7)
(sum level5 level13 level18)
(sum level5 level14 level19)
(sum level5 level20 level25)
(sum level5 level23 level28)
(sum level5 level24 level29)
(sum level6 level2 level8)
(sum level6 level13 level19)
(sum level6 level14 level20)
(sum level6 level20 level26)
(sum level6 level23 level29)
(sum level6 level24 level30)
(sum level7 level2 level9)
(sum level7 level13 level20)
(sum level7 level14 level21)
(sum level7 level20 level27)
(sum level7 level23 level30)
(sum level7 level24 level31)
(sum level8 level2 level10)
(sum level8 level13 level21)
(sum level8 level14 level22)
(sum level8 level20 level28)
(sum level8 level23 level31)
(sum level8 level24 level32)
(sum level9 level2 level11)
(sum level9 level13 level22)
(sum level9 level14 level23)
(sum level9 level20 level29)
(sum level9 level23 level32)
(sum level9 level24 level33)
(sum level10 level2 level12)
(sum level10 level13 level23)
(sum level10 level14 level24)
(sum level10 level20 level30)
(sum level10 level23 level33)
(sum level10 level24 level34)
(sum level11 level2 level13)
(sum level11 level13 level24)
(sum level11 level14 level25)
(sum level11 level20 level31)
(sum level11 level23 level34)
(sum level11 level24 level35)
(sum level12 level2 level14)
(sum level12 level13 level25)
(sum level12 level14 level26)
(sum level12 level20 level32)
(sum level12 level23 level35)
(sum level12 level24 level36)
(sum level13 level2 level15)
(sum level13 level13 level26)
(sum level13 level14 level27)
(sum level13 level20 level33)
(sum level13 level23 level36)
(sum level13 level24 level37)
(sum level14 level2 level16)
(sum level14 level13 level27)
(sum level14 level14 level28)
(sum level14 level20 level34)
(sum level14 level23 level37)
(sum level14 level24 level38)
(sum level15 level2 level17)
(sum level15 level13 level28)
(sum level15 level14 level29)
(sum level15 level20 level35)
(sum level15 level23 level38)
(sum level15 level24 level39)
(sum level16 level2 level18)
(sum level16 level13 level29)
(sum level16 level14 level30)
(sum level16 level20 level36)
(sum level16 level23 level39)
(sum level16 level24 level40)
(sum level17 level2 level19)
(sum level17 level13 level30)
(sum level17 level14 level31)
(sum level17 level20 level37)
(sum level17 level23 level40)
(sum level17 level24 level41)
(sum level18 level2 level20)
(sum level18 level13 level31)
(sum level18 level14 level32)
(sum level18 level20 level38)
(sum level18 level23 level41)
(sum level18 level24 level42)
(sum level19 level2 level21)
(sum level19 level13 level32)
(sum level19 level14 level33)
(sum level19 level20 level39)
(sum level19 level23 level42)
(sum level19 level24 level43)
(sum level20 level2 level22)
(sum level20 level13 level33)
(sum level20 level14 level34)
(sum level20 level20 level40)
(sum level20 level23 level43)
(sum level20 level24 level44)
(sum level21 level2 level23)
(sum level21 level13 level34)
(sum level21 level14 level35)
(sum level21 level20 level41)
(sum level21 level23 level44)
(sum level21 level24 level45)
(sum level22 level2 level24)
(sum level22 level13 level35)
(sum level22 level14 level36)
(sum level22 level20 level42)
(sum level22 level23 level45)
(sum level22 level24 level46)
(sum level23 level2 level25)
(sum level23 level13 level36)
(sum level23 level14 level37)
(sum level23 level20 level43)
(sum level23 level23 level46)
(sum level23 level24 level47)
(sum level24 level2 level26)
(sum level24 level13 level37)
(sum level24 level14 level38)
(sum level24 level20 level44)
(sum level24 level23 level47)
(sum level24 level24 level48)
(sum level25 level2 level27)
(sum level25 level13 level38)
(sum level25 level14 level39)
(sum level25 level20 level45)
(sum level25 level23 level48)
(sum level25 level24 level49)
(sum level26 level2 level28)
(sum level26 level13 level39)
(sum level26 level14 level40)
(sum level26 level20 level46)
(sum level26 level23 level49)
(sum level26 level24 level50)
(sum level27 level2 level29)
(sum level27 level13 level40)
(sum level27 level14 level41)
(sum level27 level20 level47)
(sum level27 level23 level50)
(sum level27 level24 level51)
(sum level28 level2 level30)
(sum level28 level13 level41)
(sum level28 level14 level42)
(sum level28 level20 level48)
(sum level28 level23 level51)
(sum level28 level24 level52)
(sum level29 level2 level31)
(sum level29 level13 level42)
(sum level29 level14 level43)
(sum level29 level20 level49)
(sum level29 level23 level52)
(sum level29 level24 level53)
(sum level30 level2 level32)
(sum level30 level13 level43)
(sum level30 level14 level44)
(sum level30 level20 level50)
(sum level30 level23 level53)
(sum level30 level24 level54)
(sum level31 level2 level33)
(sum level31 level13 level44)
(sum level31 level14 level45)
(sum level31 level20 level51)
(sum level31 level23 level54)
(sum level31 level24 level55)
(sum level32 level2 level34)
(sum level32 level13 level45)
(sum level32 level14 level46)
(sum level32 level20 level52)
(sum level32 level23 level55)
(sum level32 level24 level56)
(sum level33 level2 level35)
(sum level33 level13 level46)
(sum level33 level14 level47)
(sum level33 level20 level53)
(sum level33 level23 level56)
(sum level33 level24 level57)
(sum level34 level2 level36)
(sum level34 level13 level47)
(sum level34 level14 level48)
(sum level34 level20 level54)
(sum level34 level23 level57)
(sum level34 level24 level58)
(sum level35 level2 level37)
(sum level35 level13 level48)
(sum level35 level14 level49)
(sum level35 level20 level55)
(sum level35 level23 level58)
(sum level35 level24 level59)
(sum level36 level2 level38)
(sum level36 level13 level49)
(sum level36 level14 level50)
(sum level36 level20 level56)
(sum level36 level23 level59)
(sum level36 level24 level60)
(sum level37 level2 level39)
(sum level37 level13 level50)
(sum level37 level14 level51)
(sum level37 level20 level57)
(sum level37 level23 level60)
(sum level37 level24 level61)
(sum level38 level2 level40)
(sum level38 level13 level51)
(sum level38 level14 level52)
(sum level38 level20 level58)
(sum level38 level23 level61)
(sum level38 level24 level62)
(sum level39 level2 level41)
(sum level39 level13 level52)
(sum level39 level14 level53)
(sum level39 level20 level59)
(sum level39 level23 level62)
(sum level39 level24 level63)
(sum level40 level2 level42)
(sum level40 level13 level53)
(sum level40 level14 level54)
(sum level40 level20 level60)
(sum level40 level23 level63)
(sum level40 level24 level64)
(sum level41 level2 level43)
(sum level41 level13 level54)
(sum level41 level14 level55)
(sum level41 level20 level61)
(sum level41 level23 level64)
(sum level41 level24 level65)
(sum level42 level2 level44)
(sum level42 level13 level55)
(sum level42 level14 level56)
(sum level42 level20 level62)
(sum level42 level23 level65)
(sum level42 level24 level66)
(sum level43 level2 level45)
(sum level43 level13 level56)
(sum level43 level14 level57)
(sum level43 level20 level63)
(sum level43 level23 level66)
(sum level43 level24 level67)
(sum level44 level2 level46)
(sum level44 level13 level57)
(sum level44 level14 level58)
(sum level44 level20 level64)
(sum level44 level23 level67)
(sum level44 level24 level68)
(sum level45 level2 level47)
(sum level45 level13 level58)
(sum level45 level14 level59)
(sum level45 level20 level65)
(sum level45 level23 level68)
(sum level45 level24 level69)
(sum level46 level2 level48)
(sum level46 level13 level59)
(sum level46 level14 level60)
(sum level46 level20 level66)
(sum level46 level23 level69)
(sum level46 level24 level70)
(sum level47 level2 level49)
(sum level47 level13 level60)
(sum level47 level14 level61)
(sum level47 level20 level67)
(sum level47 level23 level70)
(sum level47 level24 level71)
(sum level48 level2 level50)
(sum level48 level13 level61)
(sum level48 level14 level62)
(sum level48 level20 level68)
(sum level48 level23 level71)
(sum level48 level24 level72)
(sum level49 level2 level51)
(sum level49 level13 level62)
(sum level49 level14 level63)
(sum level49 level20 level69)
(sum level49 level23 level72)
(sum level49 level24 level73)
(sum level50 level2 level52)
(sum level50 level13 level63)
(sum level50 level14 level64)
(sum level50 level20 level70)
(sum level50 level23 level73)
(sum level50 level24 level74)
(sum level51 level2 level53)
(sum level51 level13 level64)
(sum level51 level14 level65)
(sum level51 level20 level71)
(sum level51 level23 level74)
(sum level51 level24 level75)
(sum level52 level2 level54)
(sum level52 level13 level65)
(sum level52 level14 level66)
(sum level52 level20 level72)
(sum level52 level23 level75)
(sum level52 level24 level76)
(sum level53 level2 level55)
(sum level53 level13 level66)
(sum level53 level14 level67)
(sum level53 level20 level73)
(sum level53 level23 level76)
(sum level53 level24 level77)
(sum level54 level2 level56)
(sum level54 level13 level67)
(sum level54 level14 level68)
(sum level54 level20 level74)
(sum level54 level23 level77)
(sum level54 level24 level78)
(sum level55 level2 level57)
(sum level55 level13 level68)
(sum level55 level14 level69)
(sum level55 level20 level75)
(sum level55 level23 level78)
(sum level55 level24 level79)
(sum level56 level2 level58)
(sum level56 level13 level69)
(sum level56 level14 level70)
(sum level56 level20 level76)
(sum level56 level23 level79)
(sum level56 level24 level80)
(sum level57 level2 level59)
(sum level57 level13 level70)
(sum level57 level14 level71)
(sum level57 level20 level77)
(sum level57 level23 level80)
(sum level57 level24 level81)
(sum level58 level2 level60)
(sum level58 level13 level71)
(sum level58 level14 level72)
(sum level58 level20 level78)
(sum level58 level23 level81)
(sum level58 level24 level82)
(sum level59 level2 level61)
(sum level59 level13 level72)
(sum level59 level14 level73)
(sum level59 level20 level79)
(sum level59 level23 level82)
(sum level59 level24 level83)
(sum level60 level2 level62)
(sum level60 level13 level73)
(sum level60 level14 level74)
(sum level60 level20 level80)
(sum level60 level23 level83)
(sum level60 level24 level84)
(sum level61 level2 level63)
(sum level61 level13 level74)
(sum level61 level14 level75)
(sum level61 level20 level81)
(sum level61 level23 level84)
(sum level61 level24 level85)
(sum level62 level2 level64)
(sum level62 level13 level75)
(sum level62 level14 level76)
(sum level62 level20 level82)
(sum level62 level23 level85)
(sum level62 level24 level86)
(sum level63 level2 level65)
(sum level63 level13 level76)
(sum level63 level14 level77)
(sum level63 level20 level83)
(sum level63 level23 level86)
(sum level63 level24 level87)
(sum level64 level2 level66)
(sum level64 level13 level77)
(sum level64 level14 level78)
(sum level64 level20 level84)
(sum level64 level23 level87)
(sum level64 level24 level88)
(sum level65 level2 level67)
(sum level65 level13 level78)
(sum level65 level14 level79)
(sum level65 level20 level85)
(sum level65 level23 level88)
(sum level65 level24 level89)
(sum level66 level2 level68)
(sum level66 level13 level79)
(sum level66 level14 level80)
(sum level66 level20 level86)
(sum level66 level23 level89)
(sum level66 level24 level90)
(sum level67 level2 level69)
(sum level67 level13 level80)
(sum level67 level14 level81)
(sum level67 level20 level87)
(sum level67 level23 level90)
(sum level67 level24 level91)
(sum level68 level2 level70)
(sum level68 level13 level81)
(sum level68 level14 level82)
(sum level68 level20 level88)
(sum level68 level23 level91)
(sum level68 level24 level92)
(sum level69 level2 level71)
(sum level69 level13 level82)
(sum level69 level14 level83)
(sum level69 level20 level89)
(sum level69 level23 level92)
(sum level69 level24 level93)
(sum level70 level2 level72)
(sum level70 level13 level83)
(sum level70 level14 level84)
(sum level70 level20 level90)
(sum level70 level23 level93)
(sum level70 level24 level94)
(sum level71 level2 level73)
(sum level71 level13 level84)
(sum level71 level14 level85)
(sum level71 level20 level91)
(sum level71 level23 level94)
(sum level71 level24 level95)
(sum level72 level2 level74)
(sum level72 level13 level85)
(sum level72 level14 level86)
(sum level72 level20 level92)
(sum level72 level23 level95)
(sum level72 level24 level96)
(sum level73 level2 level75)
(sum level73 level13 level86)
(sum level73 level14 level87)
(sum level73 level20 level93)
(sum level73 level23 level96)
(sum level73 level24 level97)
(sum level74 level2 level76)
(sum level74 level13 level87)
(sum level74 level14 level88)
(sum level74 level20 level94)
(sum level74 level23 level97)
(sum level74 level24 level98)
(sum level75 level2 level77)
(sum level75 level13 level88)
(sum level75 level14 level89)
(sum level75 level20 level95)
(sum level75 level23 level98)
(sum level75 level24 level99)
(sum level76 level2 level78)
(sum level76 level13 level89)
(sum level76 level14 level90)
(sum level76 level20 level96)
(sum level76 level23 level99)
(sum level76 level24 level100)
(sum level77 level2 level79)
(sum level77 level13 level90)
(sum level77 level14 level91)
(sum level77 level20 level97)
(sum level77 level23 level100)
(sum level77 level24 level101)
(sum level78 level2 level80)
(sum level78 level13 level91)
(sum level78 level14 level92)
(sum level78 level20 level98)
(sum level78 level23 level101)
(sum level78 level24 level102)
(sum level79 level2 level81)
(sum level79 level13 level92)
(sum level79 level14 level93)
(sum level79 level20 level99)
(sum level79 level23 level102)
(sum level79 level24 level103)
(sum level80 level2 level82)
(sum level80 level13 level93)
(sum level80 level14 level94)
(sum level80 level20 level100)
(sum level80 level23 level103)
(sum level80 level24 level104)
(sum level81 level2 level83)
(sum level81 level13 level94)
(sum level81 level14 level95)
(sum level81 level20 level101)
(sum level81 level23 level104)
(sum level81 level24 level105)
(sum level82 level2 level84)
(sum level82 level13 level95)
(sum level82 level14 level96)
(sum level82 level20 level102)
(sum level82 level23 level105)
(sum level82 level24 level106)
(sum level83 level2 level85)
(sum level83 level13 level96)
(sum level83 level14 level97)
(sum level83 level20 level103)
(sum level83 level23 level106)
(sum level83 level24 level107)
(sum level84 level2 level86)
(sum level84 level13 level97)
(sum level84 level14 level98)
(sum level84 level20 level104)
(sum level84 level23 level107)
(sum level84 level24 level108)
(sum level85 level2 level87)
(sum level85 level13 level98)
(sum level85 level14 level99)
(sum level85 level20 level105)
(sum level85 level23 level108)
(sum level85 level24 level109)
(sum level86 level2 level88)
(sum level86 level13 level99)
(sum level86 level14 level100)
(sum level86 level20 level106)
(sum level86 level23 level109)
(sum level86 level24 level110)
(sum level87 level2 level89)
(sum level87 level13 level100)
(sum level87 level14 level101)
(sum level87 level20 level107)
(sum level87 level23 level110)
(sum level87 level24 level111)
(sum level88 level2 level90)
(sum level88 level13 level101)
(sum level88 level14 level102)
(sum level88 level20 level108)
(sum level88 level23 level111)
(sum level88 level24 level112)
(sum level89 level2 level91)
(sum level89 level13 level102)
(sum level89 level14 level103)
(sum level89 level20 level109)
(sum level89 level23 level112)
(sum level89 level24 level113)
(sum level90 level2 level92)
(sum level90 level13 level103)
(sum level90 level14 level104)
(sum level90 level20 level110)
(sum level90 level23 level113)
(sum level90 level24 level114)
(sum level91 level2 level93)
(sum level91 level13 level104)
(sum level91 level14 level105)
(sum level91 level20 level111)
(sum level91 level23 level114)
(sum level91 level24 level115)
(sum level92 level2 level94)
(sum level92 level13 level105)
(sum level92 level14 level106)
(sum level92 level20 level112)
(sum level92 level23 level115)
(sum level92 level24 level116)
(sum level93 level2 level95)
(sum level93 level13 level106)
(sum level93 level14 level107)
(sum level93 level20 level113)
(sum level93 level23 level116)
(sum level93 level24 level117)
(sum level94 level2 level96)
(sum level94 level13 level107)
(sum level94 level14 level108)
(sum level94 level20 level114)
(sum level94 level23 level117)
(sum level94 level24 level118)
(sum level95 level2 level97)
(sum level95 level13 level108)
(sum level95 level14 level109)
(sum level95 level20 level115)
(sum level95 level23 level118)
(sum level95 level24 level119)
(sum level96 level2 level98)
(sum level96 level13 level109)
(sum level96 level14 level110)
(sum level96 level20 level116)
(sum level96 level23 level119)
(sum level96 level24 level120)
(sum level97 level2 level99)
(sum level97 level13 level110)
(sum level97 level14 level111)
(sum level97 level20 level117)
(sum level97 level23 level120)
(sum level97 level24 level121)
(sum level98 level2 level100)
(sum level98 level13 level111)
(sum level98 level14 level112)
(sum level98 level20 level118)
(sum level98 level23 level121)
(sum level98 level24 level122)
(sum level99 level2 level101)
(sum level99 level13 level112)
(sum level99 level14 level113)
(sum level99 level20 level119)
(sum level99 level23 level122)
(sum level99 level24 level123)
(sum level100 level2 level102)
(sum level100 level13 level113)
(sum level100 level14 level114)
(sum level100 level20 level120)
(sum level100 level23 level123)
(sum level100 level24 level124)
(sum level101 level2 level103)
(sum level101 level13 level114)
(sum level101 level14 level115)
(sum level101 level20 level121)
(sum level101 level23 level124)
(sum level101 level24 level125)
(sum level102 level2 level104)
(sum level102 level13 level115)
(sum level102 level14 level116)
(sum level102 level20 level122)
(sum level102 level23 level125)
(sum level102 level24 level126)
(sum level103 level2 level105)
(sum level103 level13 level116)
(sum level103 level14 level117)
(sum level103 level20 level123)
(sum level103 level23 level126)
(sum level103 level24 level127)
(sum level104 level2 level106)
(sum level104 level13 level117)
(sum level104 level14 level118)
(sum level104 level20 level124)
(sum level104 level23 level127)
(sum level104 level24 level128)
(sum level105 level2 level107)
(sum level105 level13 level118)
(sum level105 level14 level119)
(sum level105 level20 level125)
(sum level105 level23 level128)
(sum level105 level24 level129)
(sum level106 level2 level108)
(sum level106 level13 level119)
(sum level106 level14 level120)
(sum level106 level20 level126)
(sum level106 level23 level129)
(sum level106 level24 level130)
(sum level107 level2 level109)
(sum level107 level13 level120)
(sum level107 level14 level121)
(sum level107 level20 level127)
(sum level107 level23 level130)
(sum level108 level2 level110)
(sum level108 level13 level121)
(sum level108 level14 level122)
(sum level108 level20 level128)
(sum level109 level2 level111)
(sum level109 level13 level122)
(sum level109 level14 level123)
(sum level109 level20 level129)
(sum level110 level2 level112)
(sum level110 level13 level123)
(sum level110 level14 level124)
(sum level110 level20 level130)
(sum level111 level2 level113)
(sum level111 level13 level124)
(sum level111 level14 level125)
(sum level112 level2 level114)
(sum level112 level13 level125)
(sum level112 level14 level126)
(sum level113 level2 level115)
(sum level113 level13 level126)
(sum level113 level14 level127)
(sum level114 level2 level116)
(sum level114 level13 level127)
(sum level114 level14 level128)
(sum level115 level2 level117)
(sum level115 level13 level128)
(sum level115 level14 level129)
(sum level116 level2 level118)
(sum level116 level13 level129)
(sum level116 level14 level130)
(sum level117 level2 level119)
(sum level117 level13 level130)
(sum level118 level2 level120)
(sum level119 level2 level121)
(sum level120 level2 level122)
(sum level121 level2 level123)
(sum level122 level2 level124)
(sum level123 level2 level125)
(sum level124 level2 level126)
(sum level125 level2 level127)
(sum level126 level2 level128)
(sum level127 level2 level129)
(sum level128 level2 level130)

(connected l0 l1)
(fuelcost level23 l0 l1)
(connected l0 l2)
(fuelcost level24 l0 l2)
(connected l0 l3)
(fuelcost level14 l0 l3)
(connected l1 l0)
(fuelcost level23 l1 l0)
(connected l1 l2)
(fuelcost level13 l1 l2)
(connected l2 l0)
(fuelcost level24 l2 l0)
(connected l2 l1)
(fuelcost level13 l2 l1)
(connected l2 l3)
(fuelcost level20 l2 l3)
(connected l2 l4)
(fuelcost level2 l2 l4)
(connected l3 l0)
(fuelcost level14 l3 l0)
(connected l3 l2)
(fuelcost level20 l3 l2)
(connected l3 l4)
(fuelcost level24 l3 l4)
(connected l4 l2)
(fuelcost level2 l4 l2)
(connected l4 l3)
(fuelcost level24 l4 l3)

(at t0 l1)
(fuel t0 level130)
(= (total-cost) 0)

(at p0 l1)
(at p1 l3)
(at p2 l3)
(at p3 l1)
(at p4 l3)
(at p5 l4)
)

(:goal
(and
(at p0 l4)
(at p1 l2)
(at p2 l2)
(at p3 l0)
(at p4 l0)
(at p5 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 0 of 6
2. (drive t0 l1 l2 level117 level13 level130)
   deleted: (at t0 l1) (fuel t0 level130)
   added: (at t0 l2) (fuel t0 level117)
   goals met: 0 of 6
3. (drive t0 l2 l4 level115 level2 level117)
   deleted: (at t0 l2) (fuel t0 level117)
   added: (at t0 l4) (fuel t0 level115)
   goals met: 0 of 6
4. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 1 of 6
5. (load p5 t0 l4)
   deleted: (at p5 l4)
   added: (in p5 t0)
   goals met: 1 of 6
6. (drive t0 l4 l3 level91 level24 level115)
   deleted: (at t0 l4) (fuel t0 level115)
   added: (at t0 l3) (fuel t0 level91)
   goals met: 1 of 6
7. (load p4 t0 l3)
   deleted: (at p4 l3)
   added: (in p4 t0)
   goals met: 1 of 6
8. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 1 of 6
9. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 1 of 6
10. (drive t0 l3 l2 level71 level20 level91)
   deleted: (at t0 l3) (fuel t0 level91)
   added: (at t0 l2) (fuel t0 level71)
   goals met: 1 of 6
11. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 2 of 6
12. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 3 of 6
13. (drive t0 l2 l1 level58 level13 level71)
   deleted: (at t0 l2) (fuel t0 level71)
   added: (at t0 l1) (fuel t0 level58)
   goals met: 3 of 6
14. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 3 of 6
15. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 4 of 6
16. (drive t0 l1 l0 level35 level23 level58)
   deleted: (at t0 l1) (fuel t0 level58)
   added: (at t0 l0) (fuel t0 level35)
   goals met: 4 of 6
17. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 5 of 6
18. (unload p4 t0 l0)
   deleted: (in p4 t0)
   added: (at p4 l0)
   goals met: 6 of 6
